Revit 2024 API
ViewSystemsAnalysisReport.AnalysisDateAndTime Property
 Identifies the analysis date and time when it was requested.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public DateTime AnalysisDateAndTime { get; }
Visual Basic
Public ReadOnly Property AnalysisDateAndTime As DateTime
	Get
Visual C++
public:
property DateTime AnalysisDateAndTime {
	DateTime get ();
}
See Also
ViewSystemsAnalysisReport Class
Autodesk.Revit.DB.Analysis Namespace